#+TITLE: 周三, 2024-12-18
* TODO OpenGL tutorial
** DONE tut 1
- State "DONE"       from              [2024-12-12 周四 08:49]
** DEFERRED tut 2
- State "DEFERRED"   from "WAITING"    [2024-12-12 周四 09:11] \\
  timeouit
- State "STARTED"    from "TODO"       [2024-12-12 周四 08:50]
* TODO ROS2 tutorial
* TODO MuJoCo document
:LOGBOOK:
CLOCK: [2024-12-17 周二 11:32]--[2024-12-17 周二 11:35] =>  0:03
:END:
* TODO UniTree SDK2
:LOGBOOK:
CLOCK: [2024-12-12 周四 10:02]--[2024-12-12 周四 10:27] =>  0:25
:END:
* TODO Simulation Survey
:LOGBOOK:
CLOCK: [2024-12-17 周二 11:35]--[2024-12-17 周二 11:57] =>  0:22
CLOCK: [2024-12-17 周二 11:20]--[2024-12-17 周二 11:24] =>  0:04
:END:
* TODO Novel Robot slides
- State "DONE"       from "TODO"       [2024-12-17 周二 15:52]
:LOGBOOK:
CLOCK: [2024-12-17 周二 16:33]--[2024-12-17 周二 16:58] =>  0:25
CLOCK: [2024-12-17 周二 15:51]--[2024-12-17 周二 15:52] =>  0:01
:END:
* TODO 08:53 prepare for interview 丁凯，
** TODO
*** TODO Short Introduction
**** 16年异常检测 深度学习
**** 博世，ADAS，力士乐，家电
**** 三维视觉无序抓取
***** 抓取规划，通信，
***** 落地产品，全自动化，
***** 拆垛码垛，强化学习
***** lidar slam项目
***** 具身智能探索，9月停了，Figure01类似
****** scenegraph, vqa,
****** query, toC
****** 轮式
****** ToC, ToB,
****** llm, clip, glip, sam, 采集标注
****** scenegraph, 多模态，泛化，
*** TODO Impression
**** 有较多图像开发工程经验和落地项目，主要工程经验在视觉系统开发和专家系统（非深度学习）
**** 具身智能项目开发以应用基础模型为核心，但主要开发内容是在提示工程，而非开发和微调等核心问题。
**** 对基础模型的基本概念掌握不足，无法进行有效分析和开发。
**** 无强化学习开发工程经验：欠缺对基础理论理解，无法表达基本的目标函数，不能有效支持开发。
**** 数据分布多样性与样本效率分不清, 数据工程开发经验不足
**** 对深度学习,生成式模型和强化学习等前沿理论关注度不够，知识面较窄
**** 对如何训练机器人没有系统性思考
**** LLM有应用（提示工程），没有开发，（基本概念不清 ,无法表达目标函数，无开发经验）
**** 数据分布多样性与样本效率分不清-->数据工程开发会有问题
**** DQN 离策略
* TODO 杨贵德
** 小米, 人像语义分割，魔改，数据集
*** u^2 net 文件夹，
** 理想，算法落地，安全性, BEV
*** 算子不支持
*** 精度验证
*** latency
** 优必选
*** 图像的分割，yolov8?sam标注化工具
*** 多模态大模型？
**** VL，V100部署未落地，
*** 千寻智能
*** VLM导航
* TODO Questions
** Focus of the current robot training with RL?
*** 数据问题
*** sim2real, real2sim,
** generative model (VAR, GAN, Diffusion Model)
*** Goal
*** related to RL
*** diffusion model (what's the goal? what does NN model? Why?)
** reinforcement learning (off policy online learning, offline line update-to-date, imitation learning issues)
*** sample efficiency
*** learning efficiency, conservative, overfitting
** LLM：
*** Training Goal?
*** metrics: perplexity (lowerbound?), cross entropy, BPC, Benchmarks (GLUE)
**** Why is longer context preferred?
* 13:58
